# 新用户审核表
drop table if exists bidding_user_apply;
create table bidding_user_apply		# 社科联使用账户
(
   userid                           char(6)                        not null,	# uxxxxx
   username                           varchar(20),
   password							varchar(20),
   address                        varchar(200),
   phone                          varchar(13),
   b_id                           char(9),		#所属社科
   result							int,		# 审核结果	0未审，1通过，2不通过
   reason							varchar(200),
   primary key (userid)
)comment = '社科新用户审核表';
insert into bidding_user_apply values
("u00100","李四00","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00101","李四01","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00102","李四02","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00103","李四03","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00104","李四04","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00105","李四05","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00106","李四06","1","浙江省杭州市余杭区","12343245345","b00000001",0,""),
("u00107","李四07","1","浙江省杭州市余杭区","12343245345","b00000000",0,""),
("u00108","李四08","1","浙江省杭州市余杭区","12343245345","b00000001",0,""),
("u00109","李四09","1","浙江省杭州市余杭区","12343245345","b00000000",0,"");
select * from bidding_user_apply;