drop table if exists item_category;
create table item_category(
	cid				int,
    categoryid		varchar(20),
    categoryname		varchar(300),		# 类别名称
    min_funds				bigint,		# 最低经费
    max_funds				bigint,			#最高经费
    primary key (cid)
    
)comment = '社科类项目的分类标准和认定表';
insert into item_category values
(1,"一类","国家社科基金重点项目",1000000,0),
(2,"一类","国家软科学研究计划重大项目",1000000,0),
(3,"二类","国家社科基金项目",500000,0),
(4,"二类","国家软科学研究计划项目",500000,0),
(5,"二类","教育部新世纪优秀人才支持计划",400000,0),
(6,"二类","教育部哲学社会科学研究重大课题攻关项目",500000,0),
(7,"二类","国家政策引导类科技计划(国家软科学研究计划)",400000,0),
(8,"二类","主持全国教科规划教育部重点项目",500000,0),
(9,"二类","国家各部委、各省、自治区、国家各部委、各省、自治区、直辖市委托专项课题",200000,0),
(10,"二类","企业以产学研合作方式委托咨询类课题",300000,0),
(11,"三类","教育部人文社会科学研究项目",100000,0),
(12,"三类","全国教育科学规划课题",120000,0),
(13,"三类","教育部留学回国人员科研启动基金",100000,0),
(14,"三类","高等学校博士学科点专项科研基金(新教师基金课题)",200000,0),
(15,"三类","省软科学研究计划项目",100000,0),
(16,"三类","省哲学社会科学规划项目",100000,0),
(17,"三类","省教育厅人文社会科学研究重点项目",150000,0),
(18,"三类","中国博士后科学基金资助",100000,0),
(19,"三类","国家各部委、各省、自治区、直辖市委托专项课题",100000,0),
(20,"三类","企业以产学研合作方式委托咨询类课题",150000,0);
select * from item_category;