
/*
drop table if exists expert_personal;
create table expert_personal
(
   ex_id                          char(6)                        not null,
   name                           varchar(30),		# 学者姓名
   password							varchar(20),
   honor						  char(4),			# 荣誉称号(外键)
   birthdate                      varchar(15),				# 出生日期
   research_specialty             char(4),		# 研究专长(外键)
   education                      varchar(20),		# 学历
   degree                         char(4) ,		# 学位(外键)
   major                      		varchar(10),		# 专业（外键）
   phone                          varchar(13),			# 电话
   email                          varchar(30),		# 邮件
   address_province                    int,		# 家庭地址-省
   address_city                        int,		# 家庭地址-市
   address_county                      int,		# 家庭地址-县
   address_detail                      varchar(80),		# 家庭地址-详细地址
   company                        varchar(100),		# 公司
   accept_invitation              int,		# 是否接收邀请	1接受，0不接受
   accept_recommend               int,		# 是否接收推荐
   tags							varchar(200),	#标签
   register_time                  varchar(50),			# 注册时间
   cancellation_time               varchar(50),			# 注销时间
   frozen						varchar(20),			# 冻结时间
   frozen_reason				varchar(200),			# 冻结原因
   primary key (ex_id)
)comment = '用户信息表';

insert into expert_personal values
("S00000","张三00","1","H000","2000-11-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00001","张三01","1","H300","1992-12-19","R001","博士研究生","D001","20101","13547678456","4456356@qq.com",110000,110100,000000,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00002","张三02","1","H999","2000-12-19","R002","博士研究生","D002","30101","13543578456","87436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00003","张三03","1","H700","2000-12-19","R003","博士研究生","D003","40101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00004","张三04","1","H500","2000-12-19","R004","博士研究生","D004","50101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00005","张三05","1","H102","2001-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00006","张三06","1","H999","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00007","张三07","1","H000","2000-12-19","R999","无","D999","13","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00008","张三08","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",0,1,"","2022-02-01","","",""),
("S00009","张三09","1","H500","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00010","张三10","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,1,"","2022-02-01","","",""),
("S00011","张三11","1","H500","2000-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,0,"","2022-02-01","","",""),
("S00012","张三12","1","H999","2000-12-19","R012","博士研究生","D012","13","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,1,"","2022-02-01","","",""),
("S00013","张三13","1","H500","2000-12-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,1,"","2022-02-01","","",""),
("S00014","张三14","1","H000","2000-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00015","张三15","1","H700","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00016","张三16","1","H202","2000-12-19","R007","博士研究生","D007","80101","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",0,0,"","2022-02-01","","",""),
("S00017","张三17","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",110000,110100,999999,"","阿里巴巴",1,1,"","2022-02-01","","",""),
("S00018","张三18","1","H000","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",110000,110500,999999,"","阿里巴巴",1,1,"","2022-02-01","","",""),
("S00019","张三19","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",110000,110500,999999,"三环","阿里巴巴",0,1,"","2022-02-01","","",""),
("S00020","张三20","1","H102","2002-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",110000,110500,999999,"","阿里巴巴",1,1,"","2022-02-01","","",""),
("S00021","张三21","1","H000","2000-12-19","R012","博士研究生","D012","13","13543678456","45436356@qq.com",110000,110500,999999,"","阿里巴巴",1,1,"","2022-02-01","","",""),
("S00022","张三22","1","H202","2000-12-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",110000,110500,999999,"三环","阿里巴巴",1,1,"","2022-02-01","","",""),
("S00023","张三001","1","H000","2000-11-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",110000,110500,999999,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00024","张三011","1","H300","1992-12-19","R001","博士研究生","D001","20101","13547678456","4456356@qq.com",110000,110100,999999,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00025","张三021","1","H999","2000-12-19","R002","博士研究生","D002","30101","13543578456","87436356@qq.com",110000,110200,999999,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00026","张三031","1","H700","2000-12-19","R003","博士研究生","D003","40101","13543678456","45436356@qq.com",110000,110700,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00027","张三041","1","H500","2000-12-19","R004","博士研究生","D004","50101","13543678456","45436356@qq.com",110000,110800,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00028","张三051","1","H102","2001-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",110000,110900,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00029","张三061","1","H999","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",120000,120100,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00030","张三071","1","H000","2000-12-19","R999","无","D999","13","13543678456","45436356@qq.com",120000,120200,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00031","张三081","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",120000,120300,999999,"","中国移动浙江分公司",0,1,"","2022-02-01","","",""),
("S00032","张三091","1","H500","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",120000,120400,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00033","张三101","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",120000,120500,999999,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00034","张三111","1","H500","2000-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",120000,120600,999999,"","字节跳动",1,0,"","2022-02-01","","",""),
("S00035","张三121","1","H999","2000-12-19","R012","博士研究生","D012","13","13543678456","45436356@qq.com",120000,120900,999999,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00036","张三002","1","H000","2000-11-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",120000,121000,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00037","张三012","1","H300","1992-12-19","R001","博士研究生","D001","20101","13547678456","4456356@qq.com",110000,110100,999999,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00038","张三022","1","H999","2000-12-19","R002","博士研究生","D002","30101","13543578456","87436356@qq.com",120000,121100,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00039","张三032","1","H700","2000-12-19","R003","博士研究生","D003","40101","13543678456","45436356@qq.com",330000,330100,330104,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00040","张三042","1","H500","2000-12-19","R004","博士研究生","D004","50101","13543678456","45436356@qq.com",130000,130100,130101,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00041","张三052","1","H102","2001-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",130000,130100,130101,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00042","张三062","1","H999","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",130000,130100,130101,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00043","张三072","1","H000","2000-12-19","R999","无","D999","13","13543678456","45436356@qq.com",330000,330100,330104,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00044","张三082","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",130000,130100,130102,"","中国移动浙江分公司",0,1,"","2022-02-01","","",""),
("S00045","张三092","1","H500","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",130000,130200,130201,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00046","张三102","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",130000,130200,130201,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00047","张三112","1","H500","2000-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",130000,130200,330101,"","字节跳动",1,0,"","2022-02-01","","",""),
("S00048","张三122","1","H999","2000-12-19","R012","博士研究生","D012","#","13543678456","45436356@qq.com",130000,130200,130201,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00049","张三003","1","H000","2000-11-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",130000,130200,130201,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00050","张三013","1","H300","1992-12-19","R001","博士研究生","D001","20101","13547678456","4456356@qq.com",110000,110100,000000,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00051","张三023","1","H999","2000-12-19","R002","博士研究生","D002","30101","13543578456","87436356@qq.com",130000,130200,130202,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00052","张三033","1","H700","2000-12-19","R003","博士研究生","D003","40101","13543678456","45436356@qq.com",130000,130200,130202,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00053","张三043","1","H500","2000-12-19","R004","博士研究生","D004","50101","13543678456","45436356@qq.com",130000,130200,130202,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00054","张三053","1","H102","2001-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",130000,130200,130202,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00055","张三063","1","H999","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",130000,130200,130202,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00056","张三073","1","H000","2000-12-19","R999","无","D999","13","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00057","张三083","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",0,1,"","2022-02-01","","",""),
("S00058","张三093","1","H500","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00059","张三103","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,1,"","2022-02-01","","",""),
("S00060","张三113","1","H500","2000-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,0,"","2022-02-01","","",""),
("S00061","张三123","1","H999","2000-12-19","R012","博士研究生","D012","#","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","字节跳动",1,1,"","2022-02-01","","",""),
("S00062","张三004","1","H000","2000-11-19","R000","博士研究生","D000","10101","13543678456","45436356@qq.com",330000,330100,330101,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00063","张三014","1","H300","1992-12-19","R001","博士研究生","D001","20101","13547678456","4456356@qq.com",110000,110100,999999,"三环","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00064","张三024","1","H999","2000-12-19","R002","博士研究生","D002","30101","13543578456","87436356@qq.com",330000,110800,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00065","张三034","1","H700","2000-12-19","R003","博士研究生","D003","40101","13543678456","45436356@qq.com",110000,110800,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00066","张三044","1","H500","2000-12-19","R004","博士研究生","D004","50101","13543678456","45436356@qq.com",110000,110800,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00067","张三054","1","H102","2001-12-19","R005","博士研究生","D005","60101","13543678456","45436356@qq.com",110000,110600,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00068","张三064","1","H999","2000-12-19","R006","博士研究生","D006","70101","13543678456","45436356@qq.com",110000,110600,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00069","张三074","1","H000","2000-12-19","R999","无","D999","13","13543678456","45436356@qq.com",330000,330100,330104,"白杨街道","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00070","张三084","1","H000","2000-12-19","R008","博士研究生","D008","90101","13543678456","45436356@qq.com",110000,110600,999999,"","中国移动浙江分公司",0,1,"","2022-02-01","","",""),
("S00071","张三094","1","H500","2000-12-19","R009","博士研究生","D009","100101","13543678456","45436356@qq.com",110000,110100,999999,"","中国移动浙江分公司",1,1,"","2022-02-01","","",""),
("S00072","张三104","1","H000","2000-12-19","R010","博士研究生","D010","110101","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",1,1,"","2022-02-01","","",""),
("S00073","张三114","1","H500","2000-12-19","R011","博士研究生","D011","120101","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",1,0,"","2022-02-01","","",""),
("S00074","张三124","1","H999","2000-12-19","R012","博士研究生","D012","#","13543678456","45436356@qq.com",110000,110100,999999,"","字节跳动",1,1,"","2022-02-01","","","");
*/

/*

# 改名
update expert_personal set name = '高春梅' where ex_id = 'S00000';
update expert_personal set name = '江勇' where ex_id = 'S00001';
update expert_personal set name = '白瑞发' where ex_id = 'S00002';
update expert_personal set name = '董军超' where ex_id = 'S00003';
update expert_personal set name = '常继青' where ex_id = 'S00004';
update expert_personal set name = '宋守军' where ex_id = 'S00005';
update expert_personal set name = '曾其育' where ex_id = 'S00006';
update expert_personal set name = '周晓霞' where ex_id = 'S00007';
update expert_personal set name = '陈秋生' where ex_id = 'S00008';
update expert_personal set name = '孙志刚' where ex_id = 'S00009';
update expert_personal set name = '梁桂梅' where ex_id = 'S00010';
update expert_personal set name = '张彦欣' where ex_id = 'S00011';
update expert_personal set name = '覃章平' where ex_id = 'S00012';
update expert_personal set name = '高勋金' where ex_id = 'S00013';
update expert_personal set name = '李文建' where ex_id = 'S00014';
update expert_personal set name = '朱文芳' where ex_id = 'S00015';
update expert_personal set name = '何晓兵' where ex_id = 'S00016';
update expert_personal set name = '李景峰' where ex_id = 'S00017';
update expert_personal set name = '陈宏斌' where ex_id = 'S00018';
update expert_personal set name = '金国栋' where ex_id = 'S00019';
update expert_personal set name = '马桂英' where ex_id = 'S00020';
update expert_personal set name = '韩晨兴' where ex_id = 'S00021';
update expert_personal set name = '傅建平' where ex_id = 'S00022';
update expert_personal set name = '陈锡凯' where ex_id = 'S00023';
update expert_personal set name = '王振清' where ex_id = 'S00024';
update expert_personal set name = '张利东' where ex_id = 'S00025';
update expert_personal set name = '李秀华' where ex_id = 'S00026';
update expert_personal set name = '张锦红' where ex_id = 'S00027';
update expert_personal set name = '吕光娥' where ex_id = 'S00028';
update expert_personal set name = '夏楠' where ex_id = 'S00029';
update expert_personal set name = '严武松' where ex_id = 'S00030';
update expert_personal set name = '李晓杰' where ex_id = 'S00031';
update expert_personal set name = '史文辉' where ex_id = 'S00032';
update expert_personal set name = '田迎利' where ex_id = 'S00033';
update expert_personal set name = '郭春霞' where ex_id = 'S00034';
update expert_personal set name = '董义博' where ex_id = 'S00035';
update expert_personal set name = '宋志文' where ex_id = 'S00036';
update expert_personal set name = '周丽红' where ex_id = 'S00037';
update expert_personal set name = '杨富凯' where ex_id = 'S00038';
update expert_personal set name = '张占民' where ex_id = 'S00039';
update expert_personal set name = '祁玉良' where ex_id = 'S00040';
update expert_personal set name = '武利军' where ex_id = 'S00041';
update expert_personal set name = '苏秋萍' where ex_id = 'S00042';
update expert_personal set name = '张庆华' where ex_id = 'S00043';
update expert_personal set name = '张忠阳' where ex_id = 'S00044';
update expert_personal set name = '吕海凤' where ex_id = 'S00045';
update expert_personal set name = '李莉' where ex_id = 'S00046';
update expert_personal set name = '陶小敏' where ex_id = 'S00047';
update expert_personal set name = '杨银生' where ex_id = 'S00048';
update expert_personal set name = '杨莉嘉' where ex_id = 'S00049';
update expert_personal set name = '樊利星' where ex_id = 'S00050';
update expert_personal set name = '罗炳恒' where ex_id = 'S00051';
update expert_personal set name = '郭利妗' where ex_id = 'S00052';
update expert_personal set name = '杨海银' where ex_id = 'S00053';
update expert_personal set name = '黄智勇' where ex_id = 'S00054';
update expert_personal set name = '刘建伟' where ex_id = 'S00055';
update expert_personal set name = '薛松' where ex_id = 'S00056';
update expert_personal set name = '高明杰' where ex_id = 'S00057';
update expert_personal set name = '梦虹桥' where ex_id = 'S00058';
update expert_personal set name = '宋华幸' where ex_id = 'S00059';
update expert_personal set name = '杨爱民' where ex_id = 'S00060';
update expert_personal set name = '严肃' where ex_id = 'S00061';
update expert_personal set name = '赵克宁' where ex_id = 'S00062';
update expert_personal set name = '范玉平' where ex_id = 'S00063';
update expert_personal set name = '陈延权' where ex_id = 'S00064';
update expert_personal set name = '邓景芬' where ex_id = 'S00065';
update expert_personal set name = '林鹏' where ex_id = 'S00066';
update expert_personal set name = '葛云龙' where ex_id = 'S00067';
update expert_personal set name = '蔺海丰' where ex_id = 'S00068';
update expert_personal set name = '何煦' where ex_id = 'S00069';
update expert_personal set name = '柳雄伟' where ex_id = 'S00070';
update expert_personal set name = '陈思艳' where ex_id = 'S00071';
update expert_personal set name = '万梦菊' where ex_id = 'S00072';
update expert_personal set name = '柯月财' where ex_id = 'S00073';
update expert_personal set name = '邓守玉' where ex_id = 'S00074';


*/

# update expert_personal set password = "1" where ex_id = "S00074";
use social;
select * from expert_personal;










