drop table if exists honor;
create table honor
(
   h_id                          char(4)                        not null,
   name                           varchar(30),		# 称号名
   level						int,
   pid							varchar(4),
   introduce					varchar(400),
   primary key (h_id)
)comment = '荣誉称号表';
insert into honor values
("H000","院士",1,"0","中国科学院院士和中国工程院院士。这是我国科技界最高的学术称号，一般为终身荣誉。"),
("H100","千人",1,"0","千人是指获得'千人计划' 的科技工作者。千人计划，全称是'海外高层次人才引进计划'。"),
("H101","千人(创新型)",2,"H100","为高校高等院校和研究机构引进的人才。"),
("H102","千人(创业型)",2,"H100","为企业引进人才。"),
("H200","万人",1,"0","国家高层次人才特殊支持计划，简称万人计划。"),
("H201","万人(第一层次(100名))",2,"H200","为具有冲击诺贝尔奖、成长为世界级科学家潜力的杰出人才。"),
("H202","万人(第二层次(8000名))",2,"H200","为国家科技和产业发展急需紧缺的领军人才，包括科技创新领军人才、科技创业领军人才、哲学社会科学领军人才、教学名师、百千万工程领军人才。"),
("H203","万人(第三层次(2000名))",2,"H200","为35岁以下具有较大发展潜力的青年拔尖人才。"),
("H300","973项目首席",1,"0","973是指国家重点基础研究发展计划"),
("H400","863项目首席",1,"0","863是指国家高技术研究发展计划。"),
("H500","长江学者",1,"0","长江学者是指获得长江学者奖励计划的科技工作者。长江学者奖励计划是教育部与香港李嘉诚基金会于1998年共同筹资设立的专项高层次人才计划。"),
("H600","杰青",1,"0","杰青是指获得国家杰出青年基金的科技工作者。杰出青年基金自1994年设立，支持在基础研究方面已取得突出成绩的青年学者自主选择研究方向开展创新研究，资助经费一般为200万，期限4年。"),
("H700","优青",1,"0","优青是指获得国家优秀青年基金的科技工作者，俗称“小杰青”。支持具备5～10年的科研经历并取得一定科研成就的青年科学技术人员，在科研第一线锐意进取、开拓创新，自主选择研究方向开展基础研究，资助经费100万，期限3年。"),
("H999","无",9,"0","");
select * from honor;