

drop table if exists degree;
create table degree
(
   de_id                          char(4)                        not null,
   name                           varchar(30),		# 学位名
   primary key (de_id)
)comment = '学位表';
insert into degree values
("D000","哲学博士学位"),
("D001","经济学博士学位"),
("D002","法学博士学位"),
("D003","教育学博士学位"),
("D004","文学博士学位"),
("D005","历史学博士学位"),
("D006","理学博士学位"),
("D007","工学博士学位"),
("D008","农学博士学位"),
("D009","医学博士学位"),
("D010","军事学博士学位"),
("D011","管理学博士学位"),
("D012","艺术学博士学位"),
("D100","哲学硕士学位"),
("D101","经济学硕士学位"),
("D102","法学硕士学位"),
("D103","教育学硕士学位"),
("D104","文学硕士学位"),
("D105","历史学硕士学位"),
("D106","理学硕士学位"),
("D107","工学硕士学位"),
("D108","农学硕士学位"),
("D109","医学硕士学位"),
("D110","军事学硕士学位"),
("D111","管理学硕士学位"),
("D112","艺术学硕士学位"),
("D200","哲学学士学位"),
("D201","经济学学士学位"),
("D202","法学学士学位"),
("D203","教育学学士学位"),
("D204","文学学士学位"),
("D205","历史学学士学位"),
("D206","理学学士学位"),
("D207","工学学士学位"),
("D208","农学学士学位"),
("D209","医学学士学位"),
("D210","军事学学士学位"),
("D211","管理学学士学位"),
("D212","艺术学学士学位"),
("D999","无");
select * from degree;


